; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v1)
		(pred_1 ?v3)
		(pred_5 ?v6)
		(pred_4 ?v6)
		(pred_3 ?v3 ?v6)
		(pred_2)
		(pred_6 ?v3))

   (:action op_2
       :parameters  (?v5 ?v4)
       :precondition (and (not-eq ?v5 ?v4) 
                          (pred_5 ?v5) (pred_5 ?v4) (pred_4 ?v5))
       :effect (and  (pred_4 ?v4)
		     (not (pred_4 ?v5))))


   (:action op_1
       :parameters (?v2 ?v7)
       :precondition  (and  (pred_1 ?v2) (pred_5 ?v7)
			    (pred_3 ?v2 ?v7) (pred_4 ?v7) (pred_2))
       :effect (and (pred_6 ?v2)
		    (not (pred_3 ?v2 ?v7)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v2  ?v7)
       :precondition  (and  (pred_1 ?v2) (pred_5 ?v7)
			    (pred_6 ?v2) (pred_4 ?v7))
       :effect (and (pred_3 ?v2 ?v7)
		    (pred_2)
		    (not (pred_6 ?v2)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_01 obj_06 obj_03 obj_02 obj_07 
          obj_05 obj_04 
)
(:init
(pred_5 obj_01)
(pred_5 obj_06)
(pred_5 obj_03)
(pred_5 obj_02)
(pred_5 obj_07)
(pred_1 obj_05)
(pred_1 obj_04)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(pred_2)
(pred_3 obj_05 obj_02)
(pred_3 obj_04 obj_07)
(pred_4 obj_03)
)
(:goal
(and
(pred_3 obj_05 obj_02)
(pred_3 obj_04 obj_02)
)
)

(:constraints
  (sometime-before  (pred_3 obj_04 obj_02) (pred_4 obj_01))
)
)

; plan
1. (op_2 obj_03 obj_07)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_07)
   goals met: 1 of 2
2. (op_1 obj_04 obj_07)
   deleted: (pred_3 obj_04 obj_07) (pred_2)
   added: (pred_6 obj_04)
   goals met: 1 of 2
3. (op_2 obj_07 obj_01)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_01)
   goals met: 1 of 2
4. (op_3 obj_04 obj_01)
   deleted: (pred_6 obj_04)
   added: (pred_3 obj_04 obj_01) (pred_2)
   goals met: 1 of 2
5. (op_2 obj_01 obj_02)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_02)
   goals met: 1 of 2
6. (op_1 obj_05 obj_02)
   deleted: (pred_3 obj_05 obj_02) (pred_2)
   added: (pred_6 obj_05)
   goals met: 0 of 2
7. (op_2 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_01)
   goals met: 0 of 2
8. (op_3 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_3 obj_05 obj_01) (pred_2)
   goals met: 0 of 2
9. (op_1 obj_04 obj_01)
   deleted: (pred_3 obj_04 obj_01) (pred_2)
   added: (pred_6 obj_04)
   goals met: 0 of 2
10. (op_2 obj_01 obj_02)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_02)
   goals met: 0 of 2
11. (op_3 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_3 obj_04 obj_02) (pred_2)
   goals met: 1 of 2
12. (op_2 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_01)
   goals met: 1 of 2
13. (op_1 obj_05 obj_01)
   deleted: (pred_3 obj_05 obj_01) (pred_2)
   added: (pred_6 obj_05)
   goals met: 1 of 2
14. (op_2 obj_01 obj_02)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_02)
   goals met: 1 of 2
15. (op_3 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_3 obj_05 obj_02) (pred_2)
   goals met: 2 of 2
